{
    "name": "Microsoft Surface Laptop (2024), Windows 11 Copilot+ PC, 13.8\" Touchscreen Display, Snapdragon X Plus (10 core), 16GB RAM, 256GB SSD Storage, Platinum",
    "product_information": {
        "standing_screen_display_size": "13.8 Inches",
        "screen_resolution": "2304 x 1536",
        "max_screen_resolution": "2304x1536",
        "processor": "snapdragon_x_plus",
        "ram": "16 GB LPDDR5x",
        "hard_drive": "256 GB SSD",
        "chipset_brand": "Qualcomm",
        "card_description": "Integrated",
        "wireless_type": "802.11ax",
        "average_battery_life_in_hours": "20 Hours",
        "brand": "Microsoft",
        "series": "Surface Laptop",
        "item_model_number": "ZGJ-00001",
        "operating_system": "Windows 11 Home",
        "item_weight": "2.96 pounds",
        "product_dimensions": "11.85 x 8.67 x 0.69 inches",
        "item_dimensions_lx_wx_h": "11.85 x 8.67 x 0.69 inches",
        "color": "Platinum",
        "processor_brand": "Qualcomm",
        "number_of_processors": "1",
        "computer_memory_type": "DDR5 SDRAM",
        "flash_memory_size": "256 GB",
        "voltage": "26 Volts",
        "batteries": "1 Lithium Ion batteries required. (included)",
        "asin": "B0CXKYTQS2",
        "customer_reviews": {
            "ratings_count": 566,
            "stars": 4.3
        },
        "best_sellers_rank": [
            "#986 in Computers & Accessories (See Top 100 in Computers & Accessories)",
            "#132 in Traditional Laptop Computers"
        ],
        "date_first_available": "March 8, 2024"
    },
    "brand": "Visit the Microsoft Store",
    "brand_url": "https://www.amazon.com/stores/Microsoft/page/84439CA7-1A07-49FD-8206-5480B77737C6?is_byline_deeplink=true&deeplink=83905696-F735-4316-8AF9-4DB27EB940FD&redirect_store_id=84439CA7-1A07-49FD-8206-5480B77737C6&lp_asin=B0CXKYTQS2&ref_=ast_bln&store_ref=bl_ast_dp_brandLogo_sto",
    "full_description": "* Some Copilot+ PCs require download of free updates to run Copilot+ PC experiences, available starting late 2024 – 2025. See aka.ms/copilotpluspcs ** Pre-release screen shown; subject to change. *** Availability of Copilot+ PC features varies by device and market. [1] Based on Cinebench 2024 Multi-threaded conducted by Microsoft in April 2024 comparing pre-release build of Surface Laptop 13.8\" and 15” with Snapdragon X Elite running pre-release Windows 11 26100 and Apple MacBook Air 13.6\" and 15” with M3 running macOS 14 Sonoma. [2] Optimized for select languages (English, Chinese (simplified), French, German, Japanese, and Spanish. Content-based and storage limitations apply. Recall is coming soon through a post-launch Windows Update. See https://aka.ms/copilotpluspcs. [3] Colors available on selected models only. Available colors, sizes, finishes, and processors may vary by store, market, and configuration. [4] Surface Laptop, excluding power supply, contains a minimum of 25% recycled content. Based on validation performed by Underwriter Laboratories, Inc. using Environmental Claim Validation Procedure for Recycled Content, UL 2809-2, Second Edition, November 7, 2023.  [5] Currently supports translation for video and audio subtitles into English from 40+ languages. See https://aka.ms/copilotpluspcs. [6] Battery life varies significantly based on device configuration, usage, network and feature configuration, signal strength, settings and other factors. See aka.ms/SurfaceBatteryPerformance for details. [7] 13.8\" Surface Laptop comes with 39 W Surface power supply. Fast charging (from 5% to 80%) is supported with minimum 65W Surface power supply or USB-C® PD charger, sold separately. Testing was conducted at Microsoft in February 2024, using pre-production devices, software, and minimum of 65W USB-C® charger under controlled conditions. The device was powered on to the desktop screen with default display brightness settings. Actual charge time will vary based on operating conditions. Measured at typical office ambient temperature of 23C.   [8] Enclosure includes A Cover, C Bucket and D Cover. 100% recycled aluminum alloy in A Cover and C Bucket. 100% recycled rare earth metals in magnets. Based on validation performed by Underwriter Laboratories, Inc. using Environmental Claim Validation Procedure (ECVP) for Recycled Content, UL 2809-2, Second Edition, November 7, 2023.  [9] Enclosure includes A Cover, C Bucket and D Cover. Based on validation performed by Underwriter Laboratories, Inc. using Environmental Claim Validation Procedure for Recycled Content, UL 2809-2, Second Edition, November 7, 2023. [10] Available colors may vary by market. [11] USB-C® port does not charge your Surface device or any device that requires more than 15W [12] Requires device with USB-C® USB4®/Thunderbolt™ 4 port and when supported by device and display. *Screens simulated; subject to change *Recall: Optimized for select languages (English, Chinese (simplified), French, German, Japanese, and Spanish.) Content-based and storage limitations apply. See [https://aka.ms/copilotpluspcs]. *Cocreator: Optimized for English text prompts See [https://aka.ms/copilotpluspcs]",
    "pricing": "$819.99",
    "list_price": "$999.99",
    "shipping_price": "FREE",
    "shipping_time": "July 2 - 7",
    "shipping_condition": "July 2 - 7",
    "shipping_details_url": "/gp/aag/details/?seller=A2YLYLTN75J8LR&sshmPath=shipping-rates",
    "availability_status": "In Stock",
    "is_coupon_exists": false,
    "images": [
        "https://m.media-amazon.com/images/I/41MbIthS+6L.jpg",
        "https://m.media-amazon.com/images/I/41+H83pXZ6L.jpg",
        "https://m.media-amazon.com/images/I/31mVb+13FbL.jpg",
        "https://m.media-amazon.com/images/I/21K5jZT9vGL.jpg",
        "https://m.media-amazon.com/images/I/11FJ6eZ7r5L.jpg",
        "https://m.media-amazon.com/images/I/41csx08TGfL.jpg"
    ],
    "product_category": "Electronics›Computers & Accessories›Computers & Tablets›Laptops›Traditional Laptops",
    "average_rating": 4.3,
    "feature_bullets": [
        "[This is a Copilot+ PC] — A new AI era begins. Experience enhanced performance and AI capabilities with Copilot+ PC, boosting productivity with security and privacy in mind",
        "[Introducing Surface Laptop] — Power, speed, and touchscreen versatility with AI features. Transform your work, play, and creativity with a razor-thin display and best-in-class specs.",
        "[Exceptional Performance] — Surface Laptop delivers faster performance than the MacBook Air M3[1], with blazing NPU speed for seamless productivity and AI apps.",
        "[All-Day Battery Life] — Up to 20 hours of battery life[6] to focus, create, and play all day.",
        "[Brilliant 13.8” Touchscreen Display] — Bright HDR tech, ultra-thin design, and optimized screen space.",
        "[Recall with Copilot+]: Easily retrieve documents, emails, or web pages with an explorable timeline of your PC's history[2] (coming soon).",
        "[Enhance Calls with Copilot+] — Improve lighting, cancel noise, and blur distractions with Windows Studio Effects for video calls. Prerelease product shown, subject to change.",
        "[Translate with Copilot+] — Real-time subtitles for 44 languages during video calls or streaming.",
        "[Cocreate with Copilot+] — Generate art from text or image prompts.",
        "[Thin and Lightweight] — Durable aluminum in four colors: Platinum, Black, Sapphire, and Dune[3]."
    ],
    "total_reviews": 566,
    "model": "ZGJ-00001",
    "customization_options": {
        "cpu": [
            {
                "asin": "B0CXKYTQS2",
                "is_selected": true,
                "value": "Snapdragon X Plus (10 core)"
            },
            {
                "asin": "B0CXKQYNPD",
                "is_selected": false,
                "value": "Snapdragon X Elite (12 core)"
            }
        ],
        "ram_size": [
            {
                "asin": "B0CXKYTQS2",
                "is_selected": true
            },
            {
                "asin": "B0CXKTB6CL",
                "is_selected": false
            }
        ],
        "hard_disk_size": [
            {
                "asin": "B0CXKQYNPD",
                "is_selected": false,
                "value": "1 TB",
                "image": "https://m.media-amazon.com/images/I/414AigJ0TGL.jpg"
            },
            {
                "asin": "B0CXKYTQS2",
                "is_selected": true,
                "value": "256 GB",
                "image": "https://m.media-amazon.com/images/I/31UyEXYVnHL.jpg"
            },
            {
                "asin": "B0CXL4DPY5",
                "is_selected": false,
                "value": "512 GB",
                "image": "https://m.media-amazon.com/images/I/414AigJ0TGL.jpg"
            }
        ],
        "automatic_backup_software_included": [
            {
                "asin": "B0CXKYTQS2",
                "is_selected": true
            },
            {
                "asin": "B0CXL21K6M",
                "is_selected": false
            }
        ],
        "color": [
            {
                "asin": "B0CXL6B4QF",
                "is_selected": false,
                "value": "Black",
                "image": "https://m.media-amazon.com/images/I/31guUiWFekL.jpg"
            },
            {
                "asin": "B0CXKV9TSN",
                "is_selected": false,
                "value": "Dune",
                "image": "https://m.media-amazon.com/images/I/41utH0EY1SL.jpg"
            },
            {
                "asin": "B0CXKYTQS2",
                "is_selected": true,
                "value": "Platinum",
                "image": "https://m.media-amazon.com/images/I/41MbIthS+6L.jpg"
            },
            {
                "asin": "B0CXKY7JYZ",
                "is_selected": false,
                "value": "Sapphire",
                "image": "https://m.media-amazon.com/images/I/31UyEXYVnHL.jpg"
            }
        ]
    },
    "seller_id": "A2YLYLTN75J8LR",
    "seller_name": "antonline",
    "ships_from": "antonline \n                                            antonline          Ships from       antonline",
    "aplus_present": true,
    "total_ratings": 566,
    "5_star_percentage": 72,
    "4_star_percentage": 11,
    "3_star_percentage": 4,
    "2_star_percentage": 3,
    "1_star_percentage": 10,
    "reviews": [
        {
            "stars": 5,
            "date": "Reviewed in the United States on October 9, 2024",
            "verified_purchase": false,
            "manufacturer_replied": false,
            "username": "Micah Cameron",
            "user_url": "https://www.amazon.com/gp/profile/amzn1.account.AFQO6XMDCAV5JYN52QF3CTGKAPIQ/ref=cm_cr_dp_d_gw_tr?ie=UTF8",
            "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Finally, a proper Macbook Air Competitor",
            "review": "Years ago, I had the original Surface Laptop, and I loved it. It remains one of my favorite laptops of all time.So before I purchased the Surface Laptop 7, I actually had a 14\" 2021 Macbook Pro. It was honestly too much laptop for my needs, but the limited port selection on the Macbook Airs ruled them out for me. Of course, my Macbook Pro was better than the Surface Laptop 7 in many ways - the mini-LED screen is just about the best laptop display you can get, full-stop, whereas the Surface's display is good but not great. The speakers on the Macbook were amazing; the Surface's are quite good but can't compete in that regard.However, I don't regret my purchase for one second because the Surface Laptop 7 is really a Macbook Air competitor, and that is where it shines. I compared the Surface and Macbook Air 13\" side by side and came away with the following conclusions:-Screen: I don't do any serious photo editing or graphic design. To me, the Surface screen is slightly better. It gets much brighter than the Air and colors seem more accurate. However, the Air has better black levels. The Surface is a touchscreen, but I never use it as I don't like fingerprints on my screens. However, if you want a touchscreen, the Surface is clearly the better option. The Surface also has a 120hz display, whereas the Air is stuck at 60hz. The difference in smoothness when scrolling or using trackpad gestures is very noticeable. The Surface's screen looks much smoother.-Speakers: I can't tell the difference between the two. The Surface's speakers are really good compared to other laptops in this class. The same is true of the Macbook Air.-Ports: I had hoped that by 2024, USB-A would be all but gone, but alas it is not. It was very annoying to have to carry around dongles to use USB-A devices on my Macbook Pro, and now I don't have to! The Air has only two USB-C ports, so clearly the Surface wins here. The Macbook Pro does have HDMI, which is nice, but I just bought a USB-C to HDMI cable that I carry around with me, so I don't need a dongle for that either.-Keyboard: I like that the Macbook Air has more than 3 levels of brightness control, but I slightly prefer the key feel on the Surface.- Trackpad: somehow, the Surface's trackpad is better. I am thrilled that Microsoft finally brought a haptic trackpad to the Surface lineup. It feels more delicate and the tactility is stronger. Macbook trackpads are still among the best in the business, but there is finally a Windows laptop that is comparable in this regard.-Login: hands down, Windows Hello is better than the fingerprint reader. It's so fast that my Surface often logs me that it feels like the laptop was left unlocked. The fingerprint scanner on Macbooks are very good, but they are not as fast, nor as convenient, as Windows Hello. My Macbook Pro could also unlock with my Apple Watch, but that almost always took longer than unlocking with my finger.-Build Quality: This has always been a strong point for Surface devices, and the Surface Laptop 7 doesn't disappoint. The laptop can be opened easily with one hand, and the fit and finish is flawless. The same is true of the Macbook Air. I can't say whether one is better than the other. The Surface is designed to be easier to service, however, and you can actually replace the SSD, which is very nice. Additionally, the black finish on my Surface is more resistant to showing fingerprints than the dark blue on the Macbook Airs, which is a fingerprint magnet.-Performance: After owning an Apple Silicon laptop, I could never go back to using an x86/x64 processor. I used Windows 11 for ARM on my Macbook for two years virtualized in Paralells, so I knew what I was getting into. All of the applications I need work beautifully on the Surface, and it is so darn fast. Of course, there are more powerful processors out there using traditional x64 architecture, but I have never used a Windows laptop that is just so snappy for every day tasks. Office apps open in 1-2 seconds. Firefox, Chrome, and Edge open in less than a second. Using gestures to swipe through apps is super snappy, and the high refresh rate screen makes transitions look so smooth. This is the kind of performance I came to except from my Apple Silicon Macbook, and it's wonderful to finally see Windows operating just as responsively.Overall, the Surface feels like an upgrade over my Macbook Pro, and I personally am fine with the tradeoffs that come with the thinner, smaller, and lighter Surface over the more powerful Macbook Pro. It is an utterly fantastic laptop that, in my opinion, is currently the best thin-and-light laptop in the world.\n  \nRead more",
            "review_url": "https://www.amazon.com/gp/customer-reviews/R1KNAKTBH577UB/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B0CXKYTQS2",
            "total_found_helpful": 226,
            "images": [],
            "variation": {}
        },
        {
            "stars": 5,
            "date": "Reviewed in the United States on April 25, 2025",
            "verified_purchase": false,
            "manufacturer_replied": false,
            "username": "James A.",
            "user_url": "https://www.amazon.com/gp/profile/amzn1.account.AGEDQ3E2ADADN4BVSKR4MILUMGNA/ref=cm_cr_dp_d_gw_tr?ie=UTF8",
            "title": "5.0 out of 5 stars\n\n\n\n\n\n\n\n  \n  \n    Elegant Computing Defined",
            "review": "This incredible, beautiful, elegant and productive laptop showcases what Microsoft is truly capable of, and I'm a Linux guy. I bought the big one - 15\" screen, 32 gig RAM, elite CPU. It is a powerhouse of a laptop.Now - there is one con, but as time progresses the problem becomes less and less of a problem and that is the ARM architecture vs standard Intel x86/64. Basically, this laptop uses a newer, different CPU architecture, which means that many applications don't work yet (YET!!). Almost everything I threw at this laptop worked out of the box and worked beautifully. There were some older applications that didn't work (SimCity Deluxe for example). But and this is a huge BUT - as time passes more applications are supported (or emulated effectively) and it becomes less and less an issue.With the 1 CON out of the way, let's talk about how amazing this laptop is:Premium feel (shell and keyboard). As good as or even better than a MacBook. Yes, for real.Speakers sound delightful.The 15\"-inch sounds like a big laptop but fits perfectly in my backpack and it is still light and small. I mean, unless you are a 5'2\" petite tiny person I don't see how this 15\" laptop is too big for someone.It is plenty fast for doing all sorts of productivity like writing papers, excel spreadsheeting, music, internet, YouTube etc. Understand this isn't a fancy Chromebook. Operating System / Applications are exceptionally fast. This laptop WILL make you more productive just by opening it. It makes you want to work it's so nice.Battery life is OUTSTANDING. If you aren't glued to this laptop for hours at a time the battery will last DAYS. Literally days.Touchpad is also legit. No problems with cursor moving around (palm detection) and typing. Just legit good.Even when watching movies it doesn't get hot. Temperature is steady and cool. I love ARM.In closing, get this laptop. It's nice. Really nice. Like honestly, the nicest laptop I've ever owned (I've had the ASUS ROG 2024, two Dell XPS 15's, Razer Blades, etc.,)For my fellow nerds in the crowd:VMWare & Vbox do NOT work. Remember that ARM is a RISC architecture and neither products support ARM (yet). Docker Desktop for Windows DOES work on ARM. Also, WSL 2.0 also works just fine.Also, with the advent of cloud, lightweight servers (I run a small cloud on my home network) we don't need powerhouse laptops anymore if you have supporting infra. When I'm on travel I just VPN into my home network and I have all the resources I need. So keep something light and portable to work from :)\n  \nRead more",
            "review_url": "https://www.amazon.com/gp/customer-reviews/R1Q2ISHEHDM8H/ref=cm_cr_dp_d_rvw_ttl?ie=UTF8&ASIN=B0CXKYTQS2",
            "total_found_helpful": 33,
            "images": [],
            "variation": {}
        },
        {
            "stars": 5,
            "date": "Reviewed in Canada on April 7, 2025",
            "verified_purchase": false,
            "manufacturer_replied": false,
            "username": "Ruth",
            "title": "Love this product and well packaged",
            "review": "Awesome product and was selling cheaper than in store during boxing week. Love that it was really nicely packaged and protected and given its a high value product they call you to get a code before leaving which is much appreciated. Great experience purchasing and unboxing! Love this laptop. Personally I love windows and can never get used to using a Mac despite having an iPhone, I love my excel shortcuts and having a touch screen so this was best choice at a reasonable price.\n  \nRead more",
            "images": [],
            "variation": {}
        },
        {
            "stars": 5,
            "date": "Reviewed in Canada on March 31, 2025",
            "verified_purchase": false,
            "manufacturer_replied": false,
            "username": "Shahabeddin kavei",
            "title": "Excellent",
            "review": "Excellent\n  \nRead more",
            "images": [],
            "variation": {}
        },
        {
            "stars": 5,
            "date": "Reviewed in Canada on November 7, 2024",
            "verified_purchase": false,
            "manufacturer_replied": false,
            "username": "Yves Bouchard",
            "title": "Surprisingly fast",
            "review": "And  it seem to run cooler  than  my  old  surface did  which  I didn't expect.The  new  battery charging  management  system  is fine  even if  it had mewondering  why  it was stubbornly  maintining a 74%  max charge at first.\n  \nRead more",
            "images": [],
            "variation": {}
        },
        {
            "stars": 1,
            "date": "Reviewed in Canada on April 21, 2025",
            "verified_purchase": false,
            "manufacturer_replied": false,
            "username": "IsraelIsrael",
            "title": "Defective Laptop Received – Won’t Start and Missing Parts",
            "review": "I received the laptop approximately one hour ago, and I am extremely disappointed with its condition. The device is defective—it does not start properly and continuously displays a message saying “attempting repairs,” but never actually initiates.Additionally, I noticed that one of the rubber feet is missing, the box arrived scratched and damaged, and the seal was already broken. These signs strongly suggest that the laptop may have been used or returned previously.This is unacceptable, especially for what should have been a new product.\n  \nRead more",
            "images": [
                "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
                "https://m.media-amazon.com/images/I/71qsdWpZ8DL.jpg",
                "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
                "https://m.media-amazon.com/images/I/61U3qq3UwLL.jpg",
                "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
                "https://m.media-amazon.com/images/I/61JAUJk93mL.jpg",
                "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
                "https://m.media-amazon.com/images/I/71Ptrog491L.jpg",
                "https://images-na.ssl-images-amazon.com/images/G/01/x-locale/common/grey-pixel.gif",
                "https://m.media-amazon.com/images/I/61NJoc7VZ2L.jpg"
            ],
            "variation": {}
        },
        {
            "stars": 5,
            "date": "Reviewed in Canada on December 30, 2024",
            "verified_purchase": false,
            "manufacturer_replied": false,
            "username": "Maurice B.",
            "title": "It's top of the line!",
            "review": "A new model, time will tell, but it is fast and furious being a 2024 model.\n  \nRead more",
            "images": [],
            "variation": {}
        }
    ]
}